Определение четности и нечетности
Определение деления на любое число
Расчет подоходного налога НДФЛ


Периметр и площадь прямоугольника, треугольника площадь, высота треугольника
средняя линия трапеции, диагональ параллелограма, площадь окружности
найти расстояние между двумя точками по координатам(две координаты для каждой точки х и у)
найти гипотенузу, написать функцию которая может решать линейные уравнения
функция которая спрашивает человека какой-то список чисел и выводит его в конец
высота трапеции